In [1]:
import pandas as pd

In [5]:
import numpy as np

In [7]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['Ohio','Texas','California'])

In [8]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [9]:
frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [10]:
state=['Texas','Utah','California']

In [11]:
frame.reindex(columns=state)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [14]:
frame.reindex(columns=state,fill_value=520)   ##填充nan

   Texas  Utah  California
a      1   520           2
c      4   520           5
d      7   520           8

In [16]:
frame.reindex(columns=state,fill_value='520xiyou')

   Texas      Utah  California
a      1  520xiyou           2
c      4  520xiyou           5
d      7  520xiyou           8

In [17]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [27]:
frame.loc['a','Ohio']

0

In [29]:
frame.loc['a','Ohio']=1

In [30]:
frame

   Ohio  Texas  California
a     1      1           2
c     3      4           5
d     6      7           8

In [31]:
##删除

In [33]:
frame.drop('a')

   Ohio  Texas  California
c     3      4           5
d     6      7           8

In [34]:
frame

   Ohio  Texas  California
a     1      1           2
c     3      4           5
d     6      7           8

In [35]:
obj = pd.Series(np.arange(5),index=['a','b','c','d','e'])

In [36]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [37]:
obj.drop('a')

b    1
c    2
d    3
e    4
dtype: int64

In [38]:
obj    ##实际上并没有删除

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [41]:
obj.drop(['a','b'])

c    2
d    3
e    4
dtype: int64

In [ ]:
##不返回，直接操作原对象

In [42]:
obj.drop('a',inplace=True)   ##没友返回，直接删除掉了

In [43]:
obj

b    1
c    2
d    3
e    4
dtype: int64

In [2]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series(np.arange(3.))

In [7]:
obj[-1]   ##因为-1是数子，但是又没有其他的标签

KeyError: -1

In [8]:
obj.loc[0:2]    ##这个是纯标签，也就是说只要是标签里面的东西就会显示出来

0    0.0
1    1.0
2    2.0
dtype: float64

In [9]:
obj.iloc[0:2]   ##这个相比与上面的少输出了一行

0    0.0
1    1.0
dtype: float64

In [10]:
obj[0:2]  ##也就是说我们如果下标只有数字的化，就是有当前存在的下标就好了

0    0.0
1    1.0
dtype: float64

KeyError: -1

In [1]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
arr=pd.Series(np.arange(4))

In [6]:
arr

0    0
1    1
2    2
3    3
dtype: int64

In [7]:
##跟换下标
arr.index=['a','b','c','d']

In [8]:
arr    ##但是依旧能够依靠数字下标进行访问

a    0
b    1
c    2
d    3
dtype: int64

In [ ]:
##利用numpu风格的比尔值数组

In [9]:
arr=pd.Series(np.random.randn(5))

In [10]:
arr

0   -0.076682
1    0.497830
2    0.087553
3   -1.763958
4    0.355983
dtype: float64

In [11]:
arr>0

0    False
1     True
2     True
3    False
4     True
dtype: bool

In [12]:
arr[arr>0]    ##numpy风格

1    0.497830
2    0.087553
4    0.355983
dtype: float64

In [52]:
##广播操作
arr*2

b    4.0
c    6.0
e    NaN
f    NaN
dtype: float64

In [53]:
arr1=arr*2

In [55]:
arr1

b    4.0
c    6.0
e    NaN
f    NaN
dtype: float64

In [56]:
arr

b    2.0
c    3.0
e    NaN
f    NaN
dtype: float64

In [58]:
arr1+arr

b    6.0
c    9.0
e    NaN
f    NaN
dtype: float64

In [14]:
##把 serise 比作字典，当使用字典的时候使用SERISE

In [15]:
'a'  in arr

False

In [16]:
arr

0   -0.076682
1    0.497830
2    0.087553
3   -1.763958
4    0.355983
dtype: float64

In [17]:
0 in arr

True

In [18]:
##用字典生成series

In [20]:
sdata = {'a':1,'b':2,'c':3,'d':4}

In [21]:
arr=pd.Series(sdata)

In [23]:
arr

a    1
b    2
c    3
d    4
dtype: int64

In [27]:
##注意
arr.index=['b','c','e','f']

In [29]:
arr

b    1
c    2
e    3
f    4
dtype: int64

In [31]:
##生成的时候要特别注意

In [33]:
sdata

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [35]:
arr=pd.Series(sdata,index=['b','c','e','f'])

In [36]:
arr   ##e f 是sadta 里面没有的东西   但是生成之后却可以改变

b    2.0
c    3.0
e    NaN
f    NaN
dtype: float64

In [38]:
##检查是否确实的函数

In [41]:
arr.isnull()

b    False
c    False
e     True
f     True
dtype: bool

In [47]:
pd.isnull(arr)

b    False
c    False
e     True
f     True
dtype: bool

In [51]:
pd.notnull(arr)

b     True
c     True
e    False
f    False
dtype: bool

In [60]:
##name

In [62]:
arr = pd.Series(np.arange(5))

In [63]:
arr

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [64]:
arr.name = 'index'

In [65]:
arr.name

'index'

In [66]:
arr

0    0
1    1
2    2
3    3
4    4
Name: index, dtype: int64

In [67]:
##一些索引对象的方法和属性

In [3]:
arr=pd.Series([1,2,3])

In [4]:
arr

0    1
1    2
2    3
dtype: int64

In [1]:
import pandas as pd

In [7]:
arr1=pd.Series([4,5,6])

In [10]:
arr.append(arr1)

0    1
1    2
2    3
0    4
1    5
2    6
dtype: int64

In [12]:
arr

0    1
1    2
2    3
dtype: int64

In [24]:
arr2=arr.append(arr1)

In [26]:
arr2

0    1
1    2
2    3
0    4
1    5
2    6
dtype: int64

In [28]:
arr2[0]    ##这里两个索引都显示了出来

0    1
0    4
dtype: int64

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [5]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [6]:
frame = pd.DataFrame(data)

In [7]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [9]:
frame.head()   ##只会现实前面五行

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [10]:
pd.DataFrame(frame,columns=['year','state','pop'])   ##改变了索引

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [12]:
frame.columns=['year','state','pop']    ##在原来的基础上改变了

In [13]:
frame

     year  state  pop
0    Ohio   2000  1.5
1    Ohio   2001  1.7
2    Ohio   2002  3.6
3  Nevada   2001  2.4
4  Nevada   2002  2.9
5  Nevada   2003  3.2

In [14]:
frame.columns=['a','year','b']

In [15]:
frame

        a  year    b
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [16]:
frame['a']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: a, dtype: object

In [17]:
frame[:]

        a  year    b
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [21]:
frame['a']=520

In [22]:
frame

     a  year    b
0  520  2000  1.5
1  520  2001  1.7
2  520  2002  3.6
3  520  2001  2.4
4  520  2002  2.9
5  520  2003  3.2

In [23]:
frame[0]=1314   ##新加了一列，并且全部赋值，有点像字典的特性

In [24]:
frame

     a  year    b     0
0  520  2000  1.5  1314
1  520  2001  1.7  1314
2  520  2002  3.6  1314
3  520  2001  2.4  1314
4  520  2002  2.9  1314
5  520  2003  3.2  1314

In [26]:
frame[0][0]     ##也就是说在dataframe 里面行想到相当与是列

1314

In [27]:
frame['a'][0]

520

In [32]:
frame['c']=np.arange(6)    ##当用一个数组在这里添加一列的时候，长度必须要相匹配

In [33]:
frame

     a  year    b     0  c
0  520  2000  1.5  1314  0
1  520  2001  1.7  1314  1
2  520  2002  3.6  1314  2
3  520  2001  2.4  1314  3
4  520  2002  2.9  1314  4
5  520  2003  3.2  1314  5

In [34]:
val = pd.Series(['a','b','c'],index=[0,2,4])

In [35]:
frame['d']=val

In [36]:
frame    ##但是添加的是一个Series 的时候就长度就不用匹配了，这个会自定添加nan

     a  year    b     0  c    d
0  520  2000  1.5  1314  0    a
1  520  2001  1.7  1314  1  NaN
2  520  2002  3.6  1314  2    b
3  520  2001  2.4  1314  3  NaN
4  520  2002  2.9  1314  4    c
5  520  2003  3.2  1314  5  NaN

In [37]:
##删除操作
del frame['d']

In [38]:
frame    ##'d'被删除了

     a  year    b     0  c
0  520  2000  1.5  1314  0
1  520  2001  1.7  1314  1
2  520  2002  3.6  1314  2
3  520  2001  2.4  1314  3
4  520  2002  2.9  1314  4
5  520  2003  3.2  1314  5

In [39]:
val = frame['a']

In [41]:
val

0    520
1    520
2    520
3    520
4    520
5    520
Name: a, dtype: int64

In [44]:

val[0]=1314

In [45]:
frame    ##原来的frmae 的值也被改变了，所以我们要复制的时候要用copy方法

      a  year    b     0  c
0  1314  2000  1.5  1314  0
1   520  2001  1.7  1314  1
2   520  2002  3.6  1314  2
3   520  2001  2.4  1314  3
4   520  2002  2.9  1314  4
5   520  2003  3.2  1314  5

In [47]:
data = {'a':[1,2],'b':[4,5,6]}

In [48]:
pd.DataFrame(data)     ##这个是不行的，因为如果字典的值是列表的话，必须要长度相同

ValueError: arrays must all be same length

In [50]:
##但是如果字典的值是一个字典的花，那就不需要长度相同
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [51]:
frame = pd.DataFrame(pop)

In [52]:
frame    ##字典里面没有的，自动变成nan

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [54]:
frame.index=[2003,2004,2001]    ##这个纯粹是改变了下标而已

In [55]:
frame

      Nevada  Ohio
2003     2.4   1.7
2004     2.9   3.6
2001     NaN   1.5

In [57]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [58]:
pd.DataFrame(pop,index=[1,2,3])

   Nevada  Ohio
1     NaN   NaN
2     NaN   NaN
3     NaN   NaN

In [59]:
pd.DataFrame(pop,index=[2001,2002,2003])      ##这个跟上面的那个是不一样的，这个会根据字典里面的值进行排序，其实字典自己就已经排序了
##但是我们让他重新排序,他会根据里面的值进行重新的排序

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [60]:
pd.DataFrame(pop)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [61]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [64]:
frame1=pd.DataFrame(pop)

In [65]:
frame1

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [68]:
frame=pd.DataFrame({'Nevada':frame1['Nevada'][:],'Ohio':frame1['Ohio'][:-1]})

In [69]:
frame

      Nevada  Ohio
2000     NaN   NaN
2001     2.4   1.7
2002     2.9   3.6

In [70]:
##初始化
##上面我们涉及到了三种赋值
##字典里面的列表，长度必须要是一样的，字典里面的字典，字典里面Series的切片，后面的两种的长度不需要一样

In [71]:
##name属性
frame.columns.name = 'cloumns'

In [73]:
##index属性
frame.index.name = 'index'

In [74]:
frame   ##显示出来了

cloumns  Nevada  Ohio
index
2000        NaN   NaN
2001        2.4   1.7
2002        2.9   3.6

In [75]:
frame.values

array([[nan, nan],
       [2.4, 1.7],
       [2.9, 3.6]])

In [79]:
frame['Nevada'][2000]='hello'

In [80]:
frame.values     ##当有多种的类型的时候，会显示出合适的类型

array([['hello', nan],
       [2.4, 1.7],
       [2.9, 3.6]], dtype=object)

In [99]:
data = np.random.randn(5,5)

In [100]:
data

array([[-0.05963019, -1.57847349,  0.79702799,  0.13039941, -0.8410567 ],
       [ 0.07257807, -0.31672339, -0.55035873,  1.09373516, -1.08707514],
       [-1.98088413, -0.02548185,  0.96057969, -0.67641652,  0.39016354],
       [ 0.99138973, -0.63104867,  2.17857453, -0.32948336,  0.42159182],
       [-0.0523256 ,  0.28073523, -0.23753392, -0.33854303,  0.2973216 ]])

In [104]:
frame = pd.DataFrame(data)     ##索引全部都是数字

In [106]:
frame[0]

0   -0.059630
1    0.072578
2   -1.980884
3    0.991390
4   -0.052326
Name: 0, dtype: float64

In [2]:
##根据重复标签进行赛选，会选取所有重复标签对应的数据

In [2]:
import pandas as pd
import numpy as np

In [1]:
##一些索引对象的方法和属性

In [4]:
##append方法

In [5]:
data=pd.DataFrame()

In [6]:
data

Empty DataFrame
Columns: []
Index: []

In [8]:
a={'a':1,'b':2}

In [9]:
b=pd.Series(a)

In [11]:
b

a    1
b    2
dtype: int64

In [13]:
b.name = 'b'

In [15]:
data.append(b)     ##也就是说append的对象如果是 Series的话，那么name会变成data的索引

     a    b
b  1.0  2.0

In [16]:
data=pd.DataFrame()

In [17]:
data

Empty DataFrame
Columns: []
Index: []

In [18]:
a=[1,2,3,4,5]    ##如果append的是列表的话，那么之按列来添加的

In [19]:
data.append(a)

   0
0  1
1  2
2  3
3  4
4  5

In [20]:
a=[[1,2,3,4,5]]

In [21]:
data.append(a)     ##如果是二维的话，就是一行一行添加的

   0  1  2  3  4
0  1  2  3  4  5

In [23]:
a=[[1,2,3],[4,5,6],[7,8,9]]

In [24]:
data.append(a)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [26]:
##difference方法，相当与差集
arr1=pd.Index([1,2,3,4,5])

In [28]:
arr2=pd.Index([1,2,3,7,8])

In [30]:
arr1.difference(arr2)

Int64Index([4, 5], dtype='int64')

In [31]:
##intersection    ##交集
arr1.intersection(arr2)

Int64Index([1, 2, 3], dtype='int64')

In [33]:
##union 并集
arr1.union(arr2)

Int64Index([1, 2, 3, 4, 5, 7, 8], dtype='int64')

In [36]:
##isin方法：判断值是不是在一个范围之中
data=pd.DataFrame(np.ones([4,4]))

In [38]:
data

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0

In [40]:
data.isin([1,2])

      0     1     2     3
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

In [41]:
~data.isin([1])     ##取isin的反

       0      1      2      3
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False

In [42]:
##reindex的方法会重新排序，而index方法是直接替换掉下标

In [44]:
##drop方法

In [4]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [5]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [7]:
data.drop('Ohio',axis=0) ##这里可以不写axis=0

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
data.drop("one",axis=1)   ##但是删除一列的时候，必须要写axis=1

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [10]:
data.drop("Ohio",axis='index')    ##也可以这么操作

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
data.drop("two",axis='columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [17]:
##drop直接操作原对象的，不返回
data.drop('Ohio',inplace=True)
data

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [18]:
##索引 选择
arr=pd.Series(range(5),index=['a','b','c','d','e'])

In [19]:
arr['f']=5

In [20]:
arr

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [21]:
arr[0]

0

In [22]:
arr['a']

0

In [23]:
arr[0:2]

a    0
b    1
dtype: int64

In [26]:
arr["a":"c"]

a    0
b    1
c    2
dtype: int64

In [34]:
arr=pd.Series(range(5),index=['a','b','c','d','e'])

In [35]:
arr[:]=10

In [36]:
arr

a    10
b    10
c    10
d    10
e    10
dtype: int64

In [38]:
arr>0

a    True
b    True
c    True
d    True
e    True
dtype: bool

In [40]:
##dataframe

In [43]:
arr=pd.DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [45]:
arr

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [48]:
data['one']        ##不能Ohio,直接报错

Colorado     4
Utah         8
New York    12
Name: one, dtype: int64

In [50]:
data[['one','two']]   ##也就是说不能用行的坐标，这个就相当与是字典

          one  two
Colorado    4    5
Utah        8    9
New York   12   13

In [54]:
data[0:2]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [56]:
data[data>5]

           one   two  three  four
Colorado   NaN   NaN      6     7
Utah       8.0   9.0     10    11
New York  12.0  13.0     14    15

In [3]:
##使用填充值的算数方法,在加法的时候，如果有的标签不存在的花，那就会填充nan,所以我们需要填充
import numpy as np
import pandas as pd

In [4]:
df1=pd.DataFrame(np.arange(12).reshape((3,4)),columns=list('abcd'))

In [5]:
df2=pd.DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))

In [6]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [7]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [8]:
df1+df2   ##一些不重叠的位置出现nan

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [66]:
##也就是说如果我们用+号的话。就会产生nan
##为了弥补这个问题，我们用add函数

In [9]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [12]:
df1 = df1+df2

In [13]:
df1

      a     b     c     d   e
0   0.0   3.0   6.0   9.0 NaN
1  14.0  17.0  20.0  23.0 NaN
2  28.0  31.0  34.0  37.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [18]:
df1.reindex(columns=['a','b','c','e','f'],fill_value=10)

      a     b     c   e   f
0   0.0   3.0   6.0 NaN  10
1  14.0  17.0  20.0 NaN  10
2  28.0  31.0  34.0 NaN  10
3   NaN   NaN   NaN NaN  10

In [19]:
##add ,radd

In [21]:
df1.add(df2)

      a     b     c     d   e
0   0.0   4.0   8.0  12.0 NaN
1  19.0  23.0  27.0  31.0 NaN
2  38.0  42.0  46.0  50.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [23]:
df1.radd(df2)

      a     b     c     d   e
0   0.0   4.0   8.0  12.0 NaN
1  19.0  23.0  27.0  31.0 NaN
2  38.0  42.0  46.0  50.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [24]:
##sub rsub

In [25]:
df1.sub(1)

      a     b     c     d   e
0  -1.0   2.0   5.0   8.0 NaN
1  13.0  16.0  19.0  22.0 NaN
2  27.0  30.0  33.0  36.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [26]:
df1

      a     b     c     d   e
0   0.0   3.0   6.0   9.0 NaN
1  14.0  17.0  20.0  23.0 NaN
2  28.0  31.0  34.0  37.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [28]:
df1.rsub(1)

      a     b     c     d   e
0   1.0  -2.0  -5.0  -8.0 NaN
1 -13.0 -16.0 -19.0 -22.0 NaN
2 -27.0 -30.0 -33.0 -36.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [30]:
df1.div(1)

      a     b     c     d   e
0   0.0   3.0   6.0   9.0 NaN
1  14.0  17.0  20.0  23.0 NaN
2  28.0  31.0  34.0  37.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [31]:
df1.rdiv(1)

          a         b         c         d   e
0       inf  0.333333  0.166667  0.111111 NaN
1  0.071429  0.058824  0.050000  0.043478 NaN
2  0.035714  0.032258  0.029412  0.027027 NaN
3       NaN       NaN       NaN       NaN NaN

In [32]:
1/df1

          a         b         c         d   e
0       inf  0.333333  0.166667  0.111111 NaN
1  0.071429  0.058824  0.050000  0.043478 NaN
2  0.035714  0.032258  0.029412  0.027027 NaN
3       NaN       NaN       NaN       NaN NaN

In [33]:
## 整除 // floordiv rfloordiv

In [34]:
df1.floordiv(5)

     a    b    c    d   e
0  0.0  0.0  1.0  1.0 NaN
1  2.0  3.0  4.0  4.0 NaN
2  5.0  6.0  6.0  7.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [35]:
df1.rfloordiv(5)

     a    b    c    d   e
0  inf  1.0  0.0  0.0 NaN
1  0.0  0.0  0.0  0.0 NaN
2  0.0  0.0  0.0  0.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [36]:
##乘法 mul rmul

In [38]:
df1.mul(3)

      a     b      c      d   e
0   0.0   9.0   18.0   27.0 NaN
1  42.0  51.0   60.0   69.0 NaN
2  84.0  93.0  102.0  111.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [39]:
df1.rmul(3)

      a     b      c      d   e
0   0.0   9.0   18.0   27.0 NaN
1  42.0  51.0   60.0   69.0 NaN
2  84.0  93.0  102.0  111.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [40]:
df1.pow(2)

       a      b       c       d   e
0    0.0    9.0    36.0    81.0 NaN
1  196.0  289.0   400.0   529.0 NaN
2  784.0  961.0  1156.0  1369.0 NaN
3    NaN    NaN     NaN     NaN NaN

In [41]:
df1.rpow(2)

             a             b             c             d   e
0          1.0  8.000000e+00  6.400000e+01  5.120000e+02 NaN
1      16384.0  1.310720e+05  1.048576e+06  8.388608e+06 NaN
2  268435456.0  2.147484e+09  1.717987e+10  1.374390e+11 NaN
3          NaN           NaN           NaN           NaN NaN

In [42]:
##广播操作 与 numpy类似

In [44]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [45]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [46]:
seriese = frame.iloc[0]

In [47]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [48]:
seriese

b    0
d    1
e    2
Name: Utah, dtype: int64

In [49]:
frame - seriese

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [50]:
##如果要在列上面进行光比操作，那么我们就必须要使用方法，指定是哪一条轴
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [51]:
seriese = frame['d']

In [52]:
seriese

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int64

In [53]:
frame.sub(seriese,axis='index')

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [55]:
frame.sub(seriese,axis=0)    ##也可以使用数字指定是哪一根轴

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [56]:
##函数用用和映射
frame = pd.DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [57]:
frame

               b         d         e
Utah   -0.303094  0.967729  0.303512
Ohio   -0.314477 -1.240584  0.792110
Texas  -0.020015  0.606434  0.747809
Oregon  0.337060  1.461653 -1.171764

In [58]:
f = lambda x:x.max()-x.min()

In [60]:
frame.apply(f)   ##会被frame 的 没一列调用一次，结果是一个以frame 的列为索引的series

b    0.651537
d    2.702236
e    1.963874
dtype: float64

In [62]:
##调用行
frame.apply(f,axis='columns')

Utah      1.270823
Ohio      2.032694
Texas     0.767824
Oregon    2.633416
dtype: float64

In [64]:
frame.apply(f,axis=1)

Utah      1.270823
Ohio      2.032694
Texas     0.767824
Oregon    2.633416
dtype: float64

In [68]:
##例子
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [70]:
frame.apply(f)

            b         d         e
min -0.314477 -1.240584 -1.171764
max  0.337060  1.461653  0.792110

In [71]:
##对单个元素使用
format = lambda x: '%.2f' %x

In [73]:
##使用applymap 的原因是以为series 有map函数逐个元素进行操作
frame.applymap(format)

            b      d      e
Utah    -0.30   0.97   0.30
Ohio    -0.31  -1.24   0.79
Texas   -0.02   0.61   0.75
Oregon   0.34   1.46  -1.17

In [75]:
frame['e'].map(format)

Utah       0.30
Ohio       0.79
Texas      0.75
Oregon    -1.17
Name: e, dtype: object

In [76]:
##排序 和 排名
obj = pd.Series(range(4),index=['d','a','b','c'])

In [78]:
obj.sort_index()  ##这个是按照下标来排序的

a    1
b    2
c    3
d    0
dtype: int64

In [79]:
obj.sort_values()   ##这个是按照值来弄的

d    0
a    1
b    2
c    3
dtype: int64

In [81]:
##默认的条件下，所有的缺失的值都会被排序到Serise的尾部

In [82]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])

In [83]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [84]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [85]:
##当对DataFrmae 排序的时候，你可以使用一列或多列作为排序建

In [86]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [88]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [89]:
frame.sort_values(by='b')      ##'a'是没有排序的

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [93]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [ ]:
##排名是指从1到有效数据点总数分配名字的操作